In [2]:
#pip install pandas
#read all the comments
import pandas as pd

df = pd.read_csv('pokemon_data.csv')
# print(df.head(3))

df_xlsx = pd.read_excel('pokemon_data.xlsx')
# print(df_xlsx.head(3))

#reading txt file using read_csv
df_txt = pd.read_csv('pokemon_data.txt', delimiter='\t')
# print(df_txt.head(5))

In [3]:
#Headers
df.columns

Index(['#', 'Name', 'Type 1', 'Type 2', 'HP', 'Attack', 'Defense', 'Sp. Atk',
       'Sp. Def', 'Speed', 'Generation', 'Legendary'],
      dtype='object')

In [4]:
#Read single column (last 5)
df['Name'][-5:]

795                Diancie
796    DiancieMega Diancie
797    HoopaHoopa Confined
798     HoopaHoopa Unbound
799              Volcanion
Name: Name, dtype: object

In [5]:
#Read multiple columns
df[['Name', 'HP']][0:5]

                    Name  HP
0              Bulbasaur  45
1                Ivysaur  60
2               Venusaur  80
3  VenusaurMega Venusaur  80
4             Charmander  39

In [6]:
#Read single row
df.iloc[1]

#                   2
Name          Ivysaur
Type 1          Grass
Type 2         Poison
HP                 60
Attack             62
Defense            63
Sp. Atk            80
Sp. Def            80
Speed              60
Generation          1
Legendary       False
Name: 1, dtype: object

In [7]:
#Read multiple rows
df.iloc[1:8]

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,78,130,111,130,85,100,1,False

In [8]:
#Read specific location [row , column]
df.iloc[3,1]

'VenusaurMega Venusaur'

In [22]:
#Read specific rows and columns 
df[['Name', 'Type 1', 'Type 2']].iloc[0:5]
# df.iloc[0:5,0:4]

   #                   Name Type 1  Type 2
0  1              Bulbasaur  Grass  Poison
1  2                Ivysaur  Grass  Poison
2  3               Venusaur  Grass  Poison
3  3  VenusaurMega Venusaur  Grass  Poison
4  4             Charmander   Fire     NaN

In [25]:
# itterate over rows (useful for data manipulation)
for index, row in df.iterrows():
    print(index, row['Name'])

# df['Name'].iloc[:]

In [24]:
#conditional statements
df.loc[df['Type 1'] == "Fire"][-5:]

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
730,662,Fletchinder,Fire,Flying,62,73,55,56,52,84,6,False
731,663,Talonflame,Fire,Flying,78,81,71,74,69,126,6,False
735,667,Litleo,Fire,Normal,62,50,58,73,54,72,6,False
736,668,Pyroar,Fire,Normal,86,68,72,109,66,106,6,False
799,721,Volcanion,Fire,Water,80,110,120,130,90,70,6,True

In [27]:
#find important mathematical information about the data like mean, variance ect
df.describe()

In [31]:
#sorting
# df.sort_values('Name', ascending=False)
df.sort_values(['Type 1', 'HP'], ascending=[1,0])[0:5] #define true false for both (type 1 = assending, hp = decending)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
520,469,Yanmega,Bug,Flying,86,76,86,116,56,95,4,False
698,637,Volcarona,Bug,Fire,85,60,65,135,105,100,5,False
231,214,Heracross,Bug,Fighting,80,125,75,40,95,85,2,False
232,214,HeracrossMega Heracross,Bug,Fighting,80,185,115,40,105,75,2,False
678,617,Accelgor,Bug,NaN,80,70,40,100,60,145,5,False

In [58]:
#changing data frame

#adding new column named total
# df['Total'] = df['HP'] + df['Attack'] + df['Defense'] + df['Sp. Atk'] + df['Sp. Def'] + df['Speed'] 


# [:] = all elements or all rows in this case
# adding new column using iloc[for what rows you want to add the column to, for which columns you want to sum (.sum (horizontal))] 

df['Total'] = df.iloc[:, 4:10].sum(axis=1) #axis = 1: Horizontal, axis = 0: vertical
#Hiba ye^^ puch lena agar samaj na aye tou

# df.head(5)

#sort values according to the new column
df.sort_values(['Total'], ascending=False)[0:5]

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary,Total
426,384,RayquazaMega Rayquaza,Dragon,Flying,105,180,100,180,100,115,3,True,780
164,150,MewtwoMega Mewtwo Y,Psychic,NaN,106,150,70,194,120,140,1,True,780
163,150,MewtwoMega Mewtwo X,Psychic,Fighting,106,190,100,154,100,130,1,True,780
422,382,KyogrePrimal Kyogre,Water,NaN,100,150,90,180,160,90,3,True,770
424,383,GroudonPrimal Groudon,Ground,Fire,100,180,160,150,90,90,3,True,770

In [56]:
# removing a column

df = df.drop(columns=['Total'])

df.head(5)

,#,Name,Type 1,Type 2,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,39,52,43,60,50,65,1,False

In [60]:
# Rearranging Columns
# df = krna zaroori hy because wapis save krna parta hy dataframe main
df = df[['#', 'Name', 'Total', 'HP', 'Type 1', 'Type 2']] #very annyoying method but easy to understand
df

       #                   Name  Total  HP   Type 1  Type 2
0      1              Bulbasaur    318  45    Grass  Poison
1      2                Ivysaur    405  60    Grass  Poison
2      3               Venusaur    525  80    Grass  Poison
3      3  VenusaurMega Venusaur    625  80    Grass  Poison
4      4             Charmander    309  39     Fire     NaN
..   ...                    ...    ...  ..      ...     ...
795  719                Diancie    600  50     Rock   Fairy
796  719    DiancieMega Diancie    700  50     Rock   Fairy
797  720    HoopaHoopa Confined    600  80  Psychic   Ghost
798  720     HoopaHoopa Unbound    680  80  Psychic    Dark
799  721              Volcanion    600  80     Fire   Water

[800 rows x 6 columns]